backend/load-tests/scenarios/browse-products.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 2
      name: "Light load - 10 concurrent users"

scenarios:
  - name: "Browse Products"
    flow:
      - get:
          url: "/api/products"
      - think: 3
      - get:
          url: "/api/products?category=Cakes"
      - think: 2